package starters

import downloadWords
import utils.PathConstants
import utils.resolveResource

fun main() {
    downloadWords(
        resolveResource(PathConstants.wordsFile),
        '現', '性', '制', '務', '支', '報', '解', '資', '際', '権',
        '判', '在', '件', '任', '増', '情', '示', '認', '確', '容',
        '演', '論', '能', '格', '過', '常', '状', '職', '構', '断',
        '登', '疑', '規', '術', '備', '供', '割', '難', '優', '収',
        '限', '歳', '警', '訪', '飛', '単', '非', '与', '財', '識',
        '退', '程', '違', '師', '易', '段', '殺', '破', '呼', '責',
        '値', '因', '富', '処', '適', '婦', '寄', '否', '余', '存',
        '座', '険', '除', '許', '危', '罪', '精', '絶', '亡', '掛',
        '突', '背', '居', '雑', '招', '賛', '犯', '似', '迷', '夢',
        '捕', '勤', '迎', '刻', '舞', '込', '欲', '探', '頼', '途',
        '抜', '暮', '慣', '貧', '祖', '婚', '浮', '押', '吸', '倒',
        '払', '忘', '更', '誤', '幾', '抱', '恐', '窓', '戻', '越',
        '互', '逃', '緒', '腹', '頂', '到', '寝', '盗', '御', '吹',
        '娘', '怒', '杯', '皆', '煙', '眠', '怖', '髪', '靴', '恥',
        '偶', '偉', '猫'
    )
}